/* Default message shown in error alert dialogs for validation errors when no more specific error message is available */
"A validation error occurred" = "Ocorreu um erro de validação";

/* Default message shown in error alert dialogs when no more specific error message is available */
"An error occurred" = "Ocorreu um erro";

/* Title for alert dialog button asking what to do with invalid values entered by the user */
"Discard Change" = "Ignorar alteração";

/* Default error message for formatting errors with bindings */
"Formatting Error" = "Erro de formatação";

/* Message shown in error alert dialogs for dictionary controller validation errors */
"Illegal key" = "Chave ilegal";

/* Message shown in error alert dialogs for dictionary controller validation errors */
"Key cannot be empty" = "A chave tem de ser preenchida";

/* Message shown in error alert dialogs for dictionary controller validation errors */
"Key is already in use" = "A chave já está a ser utilizada";

/* Message shown in error alert dialogs for dictionary controller validation errors */
"Value for %@ cannot be empty" = "O valor de %@ tem de ser preenchido";

